Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: If the test fails, the debugger is automatically invoked.
it_it: Se il test fallisce, il debugger viene richiamato automaticamente.

source: If the tests don't change the resource, there's no harm in their sharing a single resource copy.
it_it: Se i test non modificano la risorsa, non c'è alcun danno nel condividere una singola copia della risorsa.

source: If the type of value is different to the mock function's return type, value is converted to the latter type at the time the expectation is set, not when the action is executed.
it_it: Se il tipo di value è diverso da quello restituito dalla funzione mock, value viene convertito in quest'ultimo tipo nel momento in cui viene impostata la expectation , non quando l'azione viene eseguita.

source: If the type of `value` is different to the mock function's return type, `value` is converted to the latter type <i>at the time the expectation is set</i>, not when the action is executed.
it_it: Se il tipo di `value` è diverso da quello restituito dalla funzione mock, `value` viene convertito in quest'ultimo tipo <i>nel momento in cui viene impostata la expectation</i>, non quando l'azione viene eseguita.

source: If the type of a callback is derived from a base callback type C, you need to implicitly cast it to C to resolve the overloading, e.g.
it_it: Se il tipo della callback deriva da un tipo di callback di base C, è necessario implicitamente eseguire il cast a C per risolvere l'overload, ad es.

source: If the type of a callback is derived from a base callback type `C`, you need to implicitly cast it to `C` to resolve the overloading, e.g.
it_it: Se il tipo della callback deriva da un tipo di callback di base `C`, è necessario implicitamente eseguire il cast a `C` per risolvere l'overload, ad es.

source: If the types are different, the function call will fail to compile, the compiler error message will say that T1 and T2 are not the same type and most likely (depending on the compiler) show you the actual values of T1 and T2.
it_it: Se i tipi sono diversi, la chiamata alla funzione non verrà compilata, il messaggio di errore del compilatore dirà che T1 e T2 non sono dello stesso tipo e molto probabilmente (a seconda del compilatore) mostrerà i valori effettivi di T1 e di T2.

source: If the types are different, the function call will fail to compile, the compiler error message will say that `T1 and T2 are not the same type` and most likely (depending on the compiler) show you the actual values of `T1` and `T2`.
it_it: Se i tipi sono diversi, la chiamata alla funzione non verrà compilata, il messaggio di errore del compilatore dirà che `T1 e T2 non sono dello stesso tipo` e molto probabilmente (a seconda del compilatore) mostrerà i valori effettivi di `T1` e di `T2`.

source: If the variable's value is "fast", the death test statement is immediately executed.
it_it: Se il valore della variabile è "fast", l'istruzione del death test viene immediatamente eseguita.

source: If the variable's value is "threadsafe", the child process re-executes the unit test binary just as it was originally invoked, but with some extra flags to cause just the single death test under consideration to be run.
it_it: Se il valore della variabile è "threadsafe", il processo figlio riesegue il binario della unit test proprio come era stato originariamente invocato, ma con alcuni flag aggiuntivi per far sì che venga eseguito solo il singolo death test in questione.

source: If the variable's value is `"fast"`, the death test statement is immediately executed.
it_it: Se il valore della variabile è `"fast"`, l'istruzione del death test viene immediatamente eseguita.

source: If the variable's value is `"threadsafe"`, the child process re-executes the unit test binary just as it was originally invoked, but with some extra flags to cause just the single death test under consideration to be run.
it_it: Se il valore della variabile è `"threadsafe"`, il processo figlio riesegue il binario della unit test proprio come era stato originariamente invocato, ma con alcuni flag aggiuntivi per far sì che venga eseguito solo il singolo death test in questione.

source: If there are *n* `WillOnce()`'s and **one** `WillRepeatedly()`, where *n* >= 0, the cardinality is `Times(AtLeast(n))`.
it_it: Se ci sono *n* `WillOnce()` e **un** `WillRepeatedly()`, dove *n* >= 0, la cardinalità è `Times(AtLeast(n))`.

source: If there are *n* `WillOnce()`'s but **no** `WillRepeatedly()`, where *n* >= 1, the cardinality is `Times(n)`.
it_it: Se ci sono *n* `WillOnce()` ma **nessun** `WillRepeatedly()`, dove *n* >= 1, la cardinalità è `Times(n)`.

source: If there are *n* `WillOnce` clauses and no `WillRepeatedly` clause, where *n* >= 1, the inferred cardinality is `Times(n)`.
it_it: Se sono presenti *n* clausole `WillOnce` e nessuna clausola `WillRepeatedly`, dove *n* >= 1, la cardinalità dedotta è `Times(n)`.

source: If there are *n* `WillOnce` clauses and one `WillRepeatedly` clause, where *n* >= 0, the inferred cardinality is `Times(AtLeast(n))`.
it_it: Se sono presenti *n* clausole `WillOnce` e una clausola `WillRepeatedly`, dove *n* >= 0, la cardinalità dedotta è `Times(AtLeast(n))`.

source: If there are n WillOnce()'s and one WillRepeatedly(), where n >= 0, the cardinality is Times(AtLeast(n)).
it_it: Se ci sono n WillOnce() e un WillRepeatedly(), dove n >= 0, la cardinalità è Times(AtLeast(n)).

source: If there are n WillOnce()'s but no WillRepeatedly(), where n >= 1, the cardinality is Times(n).
it_it: Se ci sono n WillOnce() ma nessun WillRepeatedly(), dove n >= 1, la cardinalità è Times(n).

source: If there are n WillOnce clauses and no WillRepeatedly clause, where n >= 1, the inferred cardinality is Times(n).
it_it: Se sono presenti n clausole WillOnce e nessuna clausola WillRepeatedly, dove n >= 1, la cardinalità dedotta è Times(n).

source: If there are n WillOnce clauses and one WillRepeatedly clause, where n >= 0, the inferred cardinality is Times(AtLeast(n)).
it_it: Se sono presenti n clausole WillOnce e una clausola WillRepeatedly, dove n >= 0, la cardinalità dedotta è Times(AtLeast(n)).

source: If there's no EXPECT_CALL and the method is called, it's possibly an error.
it_it: Se non c'è EXPECT_CALL e il metodo viene chiamato, probabilmente si tratta di un errore.

source: If there's no `EXPECT_CALL` and the method is called, it's possibly an error.
it_it: Se non c'è `EXPECT_CALL` e il metodo viene chiamato, probabilmente si tratta di un errore.

source: If this function is called but the arguments don't match any EXPECT_CALL() statement, it will be an error.
it_it: Se questa funzione viene chiamata ma gli argomenti non corrispondono ad alcuna istruzione EXPECT_CALL(), sarà un errore.

source: If this function is called but the arguments don't match any `EXPECT_CALL()` statement, it will be an error.
it_it: Se questa funzione viene chiamata ma gli argomenti non corrispondono ad alcuna istruzione `EXPECT_CALL()`, sarà un errore.

source: If this is a problem, you should add proper synchronization logic to action1 and action2 to make the test thread-safe.
it_it: Se questo è un problema, si deve aggiungere una logica di sincronizzazione adeguata ad action1 e ad action2 per rendere il test thread-safe.

source: If this is a problem, you should add proper synchronization logic to `action1` and `action2` to make the test thread-safe.
it_it: Se questo è un problema, si deve aggiungere una logica di sincronizzazione adeguata ad `action1` e ad `action2` per rendere il test thread-safe.

source: If this is blocking you, please file a bug.
it_it: Se questo è bloccante, segnalare un bug.

source: If this is not what you want, you can ask an expectation to retire as soon as it becomes saturated:
it_it: Se questo non è quello che si desidera, si può a chiedere una expectation ritirarsi non appena diventa satura:

source: If used in a global test environment SetUp() method, it skips all tests in the test program.
it_it: Se utilizzato in un metodo SetUp() dell'ambiente di test globale, salta tutti i test nel programma di test.

source: If used in a global test environment `SetUp()` method, it skips all tests in the test program.
it_it: Se utilizzato in un metodo `SetUp()` dell'ambiente di test globale, salta tutti i test nel programma di test.

source: If used in a test fixture `SetUp()` method, it skips all tests in the corresponding test suite.
it_it: Se utilizzato in un metodo `SetUp()` di fixture, salta tutti i test nella test suite corrispondente.

source: If used on two C strings, it tests if they are in different memory locations, not if they have different values.
it_it: Se utilizzato su due stringhe C, verifica se si trovano in posizioni di memoria diverse, non se hanno valori diversi.

source: If used on two C strings, it tests if they are in the same memory location, not if they have the same value.
it_it: Se utilizzato su due stringhe C, verifica se si trovano nella stessa posizione di memoria, non se hanno lo stesso valore.

source: If we mock it as is, using the mock will be awkward.
it_it: Se si crea il mock così com'è, il suo uso risulterà problematico.

source: If we view EXPECT_CALL() statements as nodes in a graph, and add an edge from node A to node B wherever A must occur before B, we can get a DAG.
it_it: Se consideriamo le istruzioni EXPECT_CALL() come nodi in un grafo e aggiungiamo un arco dal nodo A al nodo B ovunque A debba trovarsi prima di B, possiamo ottenere un DAG.

source: If we view `EXPECT_CALL()` statements as nodes in a graph, and add an edge from node A to node B wherever A must occur before B, we can get a DAG.
it_it: Se consideriamo le istruzioni `EXPECT_CALL()` come nodi in un grafo e aggiungiamo un arco dal nodo A al nodo B ovunque A debba trovarsi prima di B, possiamo ottenere un DAG.

source: If we were to determine the order of tests based on test name instead of test case name, then we would have a problem with the following situation:
it_it: Se dovessimo determinare l'ordine dei test in base al nome del test invece che al nome del test case, avremmo un problema con la seguente situazione:

source: If we were to support EXPECT_NE(NULL, ptr), for consistency we'd have to support EXPECT_NE(ptr, NULL) as well.
it_it: Se dovessimo supportare EXPECT_NE(NULL, ptr), per coerenza dovremmo supportare anche EXPECT_NE(ptr, NULL).

source: If we were to support `EXPECT_NE(NULL, ptr)`, for consistency we'd have to support `EXPECT_NE(ptr, NULL)` as well.
it_it: Se dovessimo supportare `EXPECT_NE(NULL, ptr)`, per coerenza dovremmo supportare anche `EXPECT_NE(ptr, NULL)`.

source: If you put the above code in a header file, you can #include it in multiple C++ source files and instantiate it multiple times.
it_it: Se si inserisce il codice precedente in un file header, si può #include-rlo in pià sorgenti C++e istanziarlo più volte.

source: If you use Visual C++ 2008 SP1, you would get the warning:
it_it: Se si usa Visual C++ 2008 SP1, si riceverà il warning:

source: If you absolutely have to test non-public interface code though, you can.
it_it: Se si deve assolutamente testare il codice dell'interfaccia non pubblica, lo si può fare.

source: If you already have a function or functor that returns bool (or a type that can be implicitly converted to bool), you can use it in a predicate assertion to get the function arguments printed for free.
it_it: Se c'è già una funzione o un funtore che restituisce bool (o un tipo che può essere convertito implicitamente in bool), lo si può usare in un'predicate assertion (asserzione di predicato) per ottenere gratuitamente la stampa degli argomenti della funzione.

source: If you already have a function or functor that returns `bool` (or a type that can be implicitly converted to `bool`), you can use it in a *predicate assertion* to get the function arguments printed for free.
it_it: Se c'è già una funzione o un funtore che restituisce `bool` (o un tipo che può essere convertito implicitamente in `bool`), lo si può usare in un *predicate assertion* (asserzione di predicato) per ottenere gratuitamente la stampa degli argomenti della funzione.

source: If you are also in the habit of giving tests descriptive names that tell what they verify, you can often easily guess what's wrong just from the test log itself.
it_it: Se si ha anche l'abitudine di dare ai test nomi descrittivi che indichino ciò che verificano, spesso si può facilmente indovinare cosa c'è che non va solo dal log.

source: If you are bothered by the "Uninteresting mock function call" message printed when a mock method without an EXPECT_CALL is called, you may use a NiceMock instead to suppress all such messages for the mock object, or suppress the message for specific methods by adding EXPECT_CALL(...).Times(AnyNumber()).
it_it: Se infastidisce dal messaggio "Uninteresting mock function call" stampato quando viene chiamato un metodo mock senza una EXPECT_CALL, si può usare invece un NiceMock per sopprimere tutti questi messaggi per l'oggetto mock, o per sopprimere il messaggio per metodi specifici aggiungendo EXPECT_CALL(...).Times(AnyNumber()).

source: If you are bothered by the "Uninteresting mock function call" message printed when a mock method without an `EXPECT_CALL` is called, you may use a `NiceMock` instead to suppress all such messages for the mock object, or suppress the message for specific methods by adding `EXPECT_CALL(...).Times(AnyNumber())`.
it_it: Se infastidisce dal messaggio "Uninteresting mock function call" stampato quando viene chiamato un metodo mock senza una `EXPECT_CALL`, si può usare invece un `NiceMock` per sopprimere tutti questi messaggi per l'oggetto mock, o per sopprimere il messaggio per metodi specifici aggiungendo `EXPECT_CALL(...).Times(AnyNumber())`.

source: If you are building a testing utility on top of GoogleTest, you'll want to test your utility.
it_it: Se si crea un'utilità di test al di sopra di GoogleTest, la si deve testare.

source: If you are concerned about the performance overhead incurred by virtual functions, and profiling confirms your concern, you can combine this with the recipe for mocking non-virtual methods.
it_it: Se si è preoccupati per la resa prestazionale sostenuta dalle funzioni virtuali e la profilazione conferma tale preoccupazione, lo si può combinare con la ricetta per i mock di metodi non-virtual.

source: If you are concerned about the performance overhead incurred by virtual functions, and profiling confirms your concern, you can combine this with the recipe for [mocking non-virtual methods](#MockingNonVirtualMethods).
it_it: Se si è preoccupati per la resa prestazionale sostenuta dalle funzioni virtuali e la profilazione conferma tale preoccupazione, lo si può combinare con la ricetta per i [mock di metodi non-virtual](#MockingNonVirtualMethods).

source: If you are defining a function (or method, functor, lambda, callback) to be used with Invoke*(), and you are not interested in some of its arguments, an alternative to WithArgs is to declare the uninteresting arguments as Unused.
it_it: Se si sta definendo una funzione (o metodo, funtore, lambda, callback) da utilizzare con Invoke*() e non si è interessati ad alcuni dei suoi argomenti, un'alternativa a WithArgs consiste nel dichiarare gli argomenti non interessanti come Unused.

source: If you are defining a function (or method, functor, lambda, callback) to be used with `Invoke*()`, and you are not interested in some of its arguments, an alternative to `WithArgs` is to declare the uninteresting arguments as `Unused`.
it_it: Se si sta definendo una funzione (o metodo, funtore, lambda, callback) da utilizzare con `Invoke*()` e non si è interessati ad alcuni dei suoi argomenti, un'alternativa a `WithArgs` consiste nel dichiarare gli argomenti non interessanti come `Unused`.

source: If you are designing an interface or concept, you can define a suite of type-parameterized tests to verify properties that any valid implementation of the interface/concept should have.
it_it: Se si sta progettando un'interfaccia o un concetto, si può definire una suite di test con i tipi parametrizzati per verificare le proprietà che dovrebbe avere qualsiasi implementazione valida dell'interfaccia/concetto.

source: If you are doing state-based testing and using a test double just to simulate the real object, you are probably better off using a fake.
it_it: Se si eseguono test basati sullo stato e si utilizza un test doppione solo per simulare l'oggetto reale, probabilmente è meglio utilizzare un falso.

source: If you are experiencing slow compilation, you can move the definition of your mock class' constructor and destructor out of the class body and into a .cc file.
it_it: Se si riscontra una compilazione lenta, si può spostare la definizione del costruttore e del distruttore della classe mock fuori dal corpo della classe e in un file .cc.

source: If you are experiencing slow compilation, you can move the definition of your mock class' constructor and destructor out of the class body and into a `.cc` file.
it_it: Se si riscontra una compilazione lenta, si può spostare la definizione del costruttore e del distruttore della classe mock fuori dal corpo della classe e in un file `.cc`.

source: If you are interested in the mock call trace but not the stack traces, you can combine --gmock_verbose=info with --gtest_stack_trace_depth=0 on the test command line.
it_it: Se si è interessati alla call trace dei mock ma non a quelle dello stack, si può combinare --gmock_verbose=info con --gtest_stack_trace_depth=0 sulla riga di comando del test.

source: If you are interested in the mock call trace but not the stack traces, you can combine `--gmock_verbose=info` with `--gtest_stack_trace_depth=0` on the test command line.
it_it: Se si è interessati alla call trace dei mock ma non a quelle dello stack, si può combinare `--gmock_verbose=info` con `--gtest_stack_trace_depth=0` sulla riga di comando del test.

source: If you are lucky, the mocks you need to use have already been implemented by some nice people.
it_it: Se si è fortunati, i mock da utilizzare sono già stati implementati da alcune persone simpatiche.

source: If you are not happy with the default action taken by gMock, you can override it using DefaultValue<T>::Set() (described here) or ON_CALL().
it_it: Se non si è soddisfatti dell'azione di default intrapresa da gMock, la si può sovrascrivere utilizzando DefaultValue<T>::Set() (descritto qui) o ON_CALL().

source: If you are not happy with the default action taken by gMock, you can override it using `DefaultValue<T>::Set()` (described [here](#DefaultValue)) or `ON_CALL()`.
it_it: Se non si è soddisfatti dell'azione di default intrapresa da gMock, la si può sovrascrivere utilizzando `DefaultValue<T>::Set()` (descritto [qui](#DefaultValue)) o `ON_CALL()`.

source: If you are not happy with the default action, you can tweak it as usual; see Setting Default Actions.
it_it: Se non si è soddisfatti dell'azione di default, la si può modificare come al solito; vedere Impostazione delle Azioni di Default.

source: If you are not happy with the default action, you can tweak it as usual; see [Setting Default Actions](#OnCall).
it_it: Se non si è soddisfatti dell'azione di default, la si può modificare come al solito; vedere [Impostazione delle Azioni di Default](#OnCall).

source: If you are not happy with the result of the type inference, you can specify the types by explicitly instantiating the template, as in Foo<long, bool>(5, false).
it_it: Se non soddisfa il risultato dell'inferenza del tipo, si possono specificare i tipi istanziando esplicitamente il template, come in Foo<long, bool>(5, false).

source: If you are not happy with the result of the type inference, you can specify the types by explicitly instantiating the template, as in `Foo<long, bool>(5, false)`.
it_it: Se non soddisfa il risultato dell'inferenza del tipo, si possono specificare i tipi istanziando esplicitamente il template, come in `Foo<long, bool>(5, false)`.

source: If you are not interested in how a mock method is called, just don't say anything about it.
it_it: Se non si è interessati a come viene chiamato un metodo mock, basta non dire nulla al riguardo.

source: If you are using it with containers whose element order are undefined (such as a std::unordered_map) you should use UnorderedElementsAre.
it_it: Se lo si sta utilizzando con contenitori il cui ordine degli elementi non è definito (come std::unordered_map) si deve utilizzare UnorderedElementsAre.

source: If you are using it with containers whose element order are undefined (such as a `std::unordered_map`) you should use `UnorderedElementsAre`.
it_it: Se lo si sta utilizzando con contenitori il cui ordine degli elementi non è definito (come `std::unordered_map`) si deve utilizzare `UnorderedElementsAre`.

source: If you are writing a function that returns an ACTION object, you'll need to know its type.
it_it: Per scrivere una funzione che restituisce un oggetto ACTION, se ne deve conoscere il tipo.

source: If you are writing a function that returns an `ACTION` object, you'll need to know its type.
it_it: Per scrivere una funzione che restituisce un oggetto `ACTION`, se ne deve conoscere il tipo.

source: If you aren't interested in the value of an argument, write _ as the argument, which means "anything goes":
it_it: Se non interessa il valore di un argomento, si scrive _ come argomento, che significa "va bene qualsiasi cosa":

source: If you aren't interested in the value of an argument, write `_` as the argument, which means "anything goes":
it_it: Se non interessa il valore di un argomento, si scrive `_` come argomento, che significa "va bene qualsiasi cosa":

source: If you build and run your tests in Emacs using the M-x google-compile command (as many googletest users do), the source file locations of gMock and googletest errors will be highlighted.
it_it: Se si creano ed eseguono i test in Emacs utilizzando il comando M-x google-compile (come fanno molti utenti di googletest), le posizioni dei sorgenti di gMock e gli errori di googletest verranno evidenziati.

source: If you build and run your tests in Emacs using the `M-x google-compile` command (as many googletest users do), the source file locations of gMock and googletest errors will be highlighted.
it_it: Se si creano ed eseguono i test in Emacs utilizzando il comando `M-x google-compile` (come fanno molti utenti di googletest), le posizioni dei sorgenti di gMock e gli errori di googletest verranno evidenziati.

source: If you change your software's internal implementation, your tests should not break as long as the change is not observable by users.
it_it: Se si modifica l'implementazione interna del software, i test non dovrebbero smettere di funzionare fin quando la modifica non è osservabile dagli utenti.

source: If you combine this with --gtest_repeat=N, GoogleTest will pick a different random seed and re-shuffle the tests in each iteration.
it_it: Combinandolo con --gtest_repeat=N, GoogleTest selezionerà un seme casuale diverso e rimischierà i test in ogni iterazione.

source: If you combine this with `--gtest_repeat=N`, GoogleTest will pick a different random seed and re-shuffle the tests in each iteration.
it_it: Combinandolo con `--gtest_repeat=N`, GoogleTest selezionerà un seme casuale diverso e rimischierà i test in ogni iterazione.

source: If you compile this using Microsoft Visual C++ 2005 SP1:
it_it: Se lo compili utilizzando Microsoft Visual C++ 2005 SP1:

source: If you create multiple of them, they will share the same set of expectations.
it_it: Se se ne creano di più, condivideranno lo stesso insieme di expectation.

source: If you do so, you'll get a compiler error.
it_it: Facendolo, si riceverà un errore del compilatore.
